using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
Задача 4
Даны целые положительные числа A, B, C. 
Значение этих чисел программа должна запрашивать у пользователя.
На прямоугольнике размера A * B размещено максимально возможное количество квадратов со стороной C.
Квадраты не накладываются друг на друга. 
Найти количество квадратов,размещенных на прямоугольнике, а также площадь незанятой части прямоугольника.
Необходимо предусмотреть служебные сообщения в случае, 
если в прямоугольнике нельзя разместить ни одного квадрата со стороной С. 
 */
namespace ConsoleAppTask4
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
